Repository: JannetBokovnya/import_vtd
Catalog: importVtd/Resources/Resources_ImpVtd.*.resx
Languages: ru_ru

# btnAnalizeFile
source: File analysis
ru_ru: Анализ файла

# buAddNewImport
source: Start import
ru_ru: Начать импорт

# buDeleteImport
source: Delete Import
ru_ru: Удалить импорт

# BuDictDefectDeleteMap
source: Cancel linking
ru_ru: Отменить увязку

# BuDictDefectMap
source: Link
ru_ru: Увязать

# BusyContent
source: Data loading
ru_ru: Загрузка данных

# cAddWithoutLink
source: Add without linking
ru_ru: Добавить без увязки

# cAngleHour
source: Weld, hour
ru_ru: Шов, час

# cAutoLink
source: Run automatic linking
ru_ru: Запустить автоматическую увязку

# cAverageCoefficientOnASite
source: Average coefficient on a site:
ru_ru: Средний коэффициент на участке

# cBenchmarkDensityPerKm
source: Benchmark density per 1 km
ru_ru: Плотность реперов на 1 км

# cCantLinkBecauseLimit
source: You can not link {0} and {1}, already linked two pipe mounting components
ru_ru: Нельзя связать {0} и {1}, уже увязано два трубных элемента

# cChoose
source: Choose...
ru_ru: Выберите данные...

# cCrackLikeDefects
source: Crack-like defects, pcs.
ru_ru: Трещиноподобные дефекты, шт.

# cDataImport
source: Data import
ru_ru: Импорт данных

# cDataImportIsEnded
source: Data import completed
ru_ru: Импорт данных завершился

# cDataImportState
source: Data import state
ru_ru: Состояние импорта данных

# cDB
source: DB
ru_ru: БД

# cDefectNumber
source: Defect number
ru_ru: Количество дефектов

# cDefects
source: Defects
ru_ru: Кол-во деф.

# cErrUnpermittedDeleteImport
source: No permission to delete import
ru_ru: Нет прав на удаление импорта

# cFile
source: File
ru_ru: Файл

# cFormDefects
source: Form defects, pcs.
ru_ru: Дефекты формы, шт.

# cImportEndedWithError
source: Data import completed with an error
ru_ru: Импорт данных завершился с ошибкой

# cImportIsRunning
source: Import in progress
ru_ru: Выполняется импорт

# cImportStatus
source: Import state
ru_ru: Состояние импорта

# cKm
source: km
ru_ru: км

# cLastImportWithError
source: Last import completed with an error
ru_ru: Последний импорт завершился с ошибкой

# cLayoutOfPipe
source: Pipe layout
ru_ru: Раскладка труб

# cLengthM
source: Length, m
ru_ru: Длина, м

# cLinkedBenchmarkNumber
source: Linked benchmark number, pcs.
ru_ru: Количество связанных реперов, шт.

# cLinkedPipeMountingComponents
source: Linked pipe mounting components
ru_ru: Сопоставленные трубные элементы

# cM
source: m
ru_ru: м

# cMagneticAnomalyNumber
source: Magnetic anomaly number, pcs.
ru_ru: Количество магнитных аномалий, шт.

# cNoData
source: No data
ru_ru: Нет данных

# cOffDesignAnomalies
source: Off-design anomalies, pcs.
ru_ru: Нерасчетные аномалии, шт.

# cPipeElementNumber
source: Pipe component number, pcs.
ru_ru: Количество трубных элементов, шт.

# cRunningImportAnotherDeny
source: Import in progress, you can not start a new import or continue not completed
ru_ru: Выполняется импорт, нельзя начать новый импорт или продолжить не завершенный

# cStaticticsOfImport
source: Statistics of import
ru_ru: Статистика импорта

# cStatisticsOfDefectsByGroups
source: Statistics of defects by groups
ru_ru: Статистика дефектов по группам

# cStressCorrosion
source: Stress-corrosion, pcs.
ru_ru: Стресс-коррозии, шт.

# cTemFromDB
source: Pipe mounting components from DB
ru_ru: Трубные элементы из БД

# cTemFromFile
source: Pipe mounting components from import file
ru_ru: Трубные элементы из файла импорта ВТД

# cThicknessMm
source: Thickness, mm
ru_ru: Толщина, мм

# cType
source: Type
ru_ru: Тип

# cWeldAnomalies
source: Weld anomalies, pcs.
ru_ru: Аномалии шва, шт.

# cСorrosionDefects
source: Сorrosion defects, pcs.
ru_ru: Коррозионные дефекты, шт.

source: Error
ru_ru: Ошибка

# ErrorDeleteImport
source: Error deleting import
ru_ru: Ошибка удаления импорта

# gbDictDefectCompar
source: Mapped types of defects
ru_ru: Сопоставленные типы дефектов

# gbDictDefectFileImport
source: Not linked defect types from the import file
ru_ru: Не связанные типы дефектов из файла импорта

# gbDictDefectTypeBD
source: Defect types from DB
ru_ru: Типы дефектов из БД

# gbNewImportBegin
source: Start, km
ru_ru: Начало, км

# gbNewImportData
source: Date
ru_ru: Дата

# gbNewImportDogovor
source: Contract
ru_ru: Договор

# gbNewImportEnd
source: End, km
ru_ru: Конец, км

# gbNewImportGenPod
source: General contractor
ru_ru: Генеральный подрядчик

# gbNewImportispolWorc
source: Contractor
ru_ru: Исполнитель работ

# cLengthKm
source: Length, km
ru_ru: Длина, км

# gbNewImportMG
source: MGP
ru_ru: МГ

# gbNewImportPipe
source: Line
ru_ru: Нитка

# gbNewImportPlaseWork
source: Work package
ru_ru: Место работ

# gbNewImportSection
source: Section
ru_ru: Участок

# grdCompareDefectColumn1
source: Defect type from DB
ru_ru: Тип дефекта из БД

# grdCompareDefectColumn2
source: Group name
ru_ru: Название группы

# grdCompareDefectColumn3
source: Object type from file
ru_ru: Тип объекта из файла

# cDefectType
source: Defect type
ru_ru: Тип дефекта

# grdTypeDefectColum2
source: Group name
ru_ru: Название группы

# gridStatecState
source: Current status
ru_ru: Текущий статус

# gridStateDataImport
source: Import date
ru_ru: Дата импорта

# gridStatedateContract
source: Date
ru_ru: Дата проведения

# gridStateFIO
source: Author
ru_ru: Автор

# gridStateNameFile
source: File name
ru_ru: Название файла

# gridStateNumberContract
source: Contact number
ru_ru: Номер договора

# gridStateSectionPipeline
source: Gas pipeline section
ru_ru: Участок газопровода

# groupBoxNewImportDataDog
source: Data on contract
ru_ru: Данные по договору

# groupBoxNewImportDataSect
source: Data on the selected section
ru_ru: Данные по выбранному участку

# groupBoxNewImportDownLoad
source: File upload
ru_ru: Загрузка файла

# groupBoxNewImportVubor
source: Extended object selection
ru_ru: Выбор протяженного объекта

source: Information
ru_ru: Информация

# linkNoReperBD
source: No data for this section
ru_ru: Нет данных для данного участка

# Message21
source: Error mapping rows
ru_ru: Ошибка сопоставления строк

# MessageBoxDictDefect1
source: Error deleting link
ru_ru: Ошибка удаления связи

# MessageBoxDictDefect2
source: Error linking dictionaries
ru_ru: Ошибка увязывания словарей

# msgDelImport
source: Delete PIGI import?
ru_ru: Удалить импорт ВТД?

# msgDelImportAttantion
source: Attention
ru_ru: Внимание

# ReperBuNextMessage
source: You should link benchmarks to import continue
ru_ru: Для продолжения импорта необходимо увязать реперы

# Repergb1
source: Benchmarks from DB
ru_ru: Реперы из БД

# Repergb2
source: Benchmarks from PIGI import file
ru_ru: Реперы из файла импорта ВТД

# Repergb3
source: Mapped objects on the section
ru_ru: Сопоставленные объекты на участке

# cKmM
source: KM, m
ru_ru: КМ, м

# ReperLenMG
source: ΔKm on MGP, m
ru_ru: ΔКм по МГ, м

# ReperLenVTD
source: ΔKm by PIGI, m
ru_ru: ΔКм по ВТД, м

# ReperMK
source: Scale factor link
ru_ru: МК увязывания

# ReperName
source: Name
ru_ru: Название

# ReperNumberLink
source: Link number
ru_ru: Номер связи

# ReperNumberSec
source: Section number
ru_ru: Количество секций

# ReperTypeobj
source: Object type
ru_ru: Тип объекта

# statusChooseImpData
source: Initial data selection
ru_ru: Выбор исходных данных

# cDefectsDictionary
source: Defect dictionary
ru_ru: Словарь дефектов

# statusErrCompl
source: Completed with error
ru_ru: Завершен с ошибкой

# cLinkingReper
source: Benchmark linking
ru_ru: Увязывание реперов

# statusLinkSection
source: Pipe journal linking
ru_ru: Увязывание трубных журналов

# cPipeJornal
source: Pipe journal
ru_ru: Раскладка труб

# statusSucessCompl
source: Successfully completed
ru_ru: Завершен успешно

# tabItemSelectdate
source: Initial data selection
ru_ru: Выбор исходных данных

# tabItemStateProcess
source: Change history
ru_ru: История изменений

# tbNameHistory
source: History of imports
ru_ru: История проведения импортов

# tbResultAnalizFile
source: File analysis result
ru_ru: Результат анализа файла

# cKmOnMg
source: Km on MGP, m
ru_ru: Км по МГ, м

# cKmOnVtd
source: Km by PIGI, m
ru_ru: Км по ВТД, м

# tubeJornalLenghtMG
source: Length by MGP, m
ru_ru: Длина по МГ, м

# tubeJornalLenghtVTD
source: Length by PIGI, m
ru_ru: Длина по ВТД, м

# tubeJornalNumberD
source: Total defects, pcs.
ru_ru: Количество дефектов, шт.

# tubeJornalNumberTube
source: Pipe number
ru_ru: Номер трубы

# tubeJornalSecLink
source: Link section
ru_ru: Участок увязки

# tubeJornalThick
source: Wall thickness, mm
ru_ru: Толщина стенки, мм

# tubeJornalType
source: Pipe type
ru_ru: Тип трубы

# cImportIsRun1
source: Import procedure is started, import:
ru_ru: Процедура импорта запущена, импорт:

# cImportIsRun2
source: it is impossible to start a new import or to continue not completed
ru_ru: нельзя начать новый импорт или продолжить не завершенный

# tbNoDataDog1
source: On the selected PIG inspection site and based on the contract
ru_ru: На выбранном участке ВТД и на основании договора

# tbNoDataDog2
source: import of PIG inspection data has been produced previously. For carrying out data import based on the contract
ru_ru: уже ранее был произведен импорт данных ВТД. Для проведения импорта данных на основании договора

# tbNoDataDog3
source: it is necessary to delete the previous PIGI import executed on its basis
ru_ru: необходимо удалить предыдущий импорт ВТД, выполненный на его основании

# tbNoDataDog4
source: Select another contract number to PIG inspection carrying out
ru_ru: Выберите иной номер договора на проведение ВТД

# gbReperLink
source: Mapped objects on the section
ru_ru: Сопоставленные объекты на участке

# cStartImport
source: Start import
ru_ru: Начать импорт
